In [125]:
!pip install fireducks
import fireducks.pandas as pd

Requirement already satisfied: fireducks in /usr/local/lib/python3.11/dist-packages (1.2.4)
Requirement already satisfied: firefw==1.2.4 in /usr/local/lib/python3.11/dist-packages (from fireducks) (1.2.4)
Requirement already satisfied: pandas<2.3.0,>=1.5.3 in /usr/local/lib/python3.11/dist-packages (from fireducks) (2.2.2)
Requirement already satisfied: pyarrow<19.1,>=19.0 in /usr/local/lib/python3.11/dist-packages (from fireducks) (19.0.1)
Requirement already satisfied: numpy>=1.23.2 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.11/dist-packages (from pandas<2.3.0,>=1.5.3->fireducks) (2025.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.8.2->pandas<2.3.0,>=1.5.3->fireducks) (1.17.0)

# 1 Planets (12 points)

In [2]:
planets_df = pd.read_csv('https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/planets.csv')
planets_df.head()

,method,number,orbital_period,mass,distance,year
0,Radial Velocity,1,269.300,7.10,77.40,2006
1,Radial Velocity,1,874.774,2.21,56.95,2008
2,Radial Velocity,1,763.000,2.60,19.84,2011
3,Radial Velocity,1,326.030,19.40,110.62,2007
4,Radial Velocity,1,516.220,10.50,119.47,2009

In [3]:
planets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

## 1. How many exoplanets are missing an orbital period? Missing a mass? Missing a distance?

In [4]:
print("Missing orbital is: ", len(planets_df[planets_df['orbital_period'].isnull()]))
print("Missing mass is: ", len(planets_df[planets_df['mass'].isnull()]))
print("Missing distance is: ", len(planets_df[planets_df['distance'].isnull()]))
print("Missing year is: ", len(planets_df[planets_df['year'].isnull()]))
print("Missing method is: ", len(planets_df[planets_df['method'].isnull()]))
print("Missing number is: ", len(planets_df[planets_df['number'].isnull()]))

Missing orbital is:  43
Missing mass is:  522
Missing distance is:  227
Missing year is:  0
Missing method is:  0
Missing number is:  0

## 2. How many exoplanets are missing both orbital period and mass?

In [5]:
len(planets_df[planets_df['orbital_period'].isnull() & planets_df['mass'].isnull()])

43

## 3. How many exoplanets are missing orbital period, mass, and distance?

In [6]:
len(planets_df[planets_df['orbital_period'].isnull() & planets_df['mass'].isnull() & planets_df['distance'].isnull() ])

11

## 4. Produce a DataFrame containing all exoplanets with missing mass. Which discovery method found the most exoplanets with missing mass?

In [7]:
planets_missing_mass = planets_df[planets_df['mass'].isnull()]
planets_missing_mass['method'].value_counts()

method
Transit                          396
Radial Velocity                   43
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          7
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: count, dtype: int64

## 5. Did the discovery method from Question 4 find any exoplanets with a known mass?

In [8]:
planets_mass = planets_df[~(planets_df['mass'].isnull())]
planets_mass['method'].value_counts()

method
Radial Velocity              510
Eclipse Timing Variations      2
Transit                        1
Name: count, dtype: int64

# 2 College (16 points)

In [126]:
links = ['https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/students.csv','https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/clubs.csv'
,'https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/courses.csv','https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/f15.csv'
,'https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/main/college/s16.csv','https://raw.githubusercontent.com/CUNY-CISC-3225/datasets/refs/heads/main/college/careers.csv'
]

students_df = pd.read_csv(links[0])
clubs_df = pd.read_csv(links[1])
courses_df = pd.read_csv(links[2])
f15_df = pd.read_csv(links[3])
s16_df = pd.read_csv(links[4])
careers_df = pd.read_csv(links[5])

print(students_df.head(),'\n')
print(clubs_df.head(), '\n')
print(courses_df.head(), '\n')
print(f15_df.head(), '\n')
print(s16_df.head(), '\n')
print(careers_df.head())

        id     name
0  7798814    Keith
1  2149193   Denise
2  5062031   Edward
3  7361386  Jeffery
4  5484525  Spencer

   student_id                 club
0     7798814              CS Club
1     2149193              CS Club
2     5062031  Cryptocurrency Club
3     7361386        Robotics Club
4     5484525    Entrepreneur Club

     id                            name
0  1001  Computing &Quantitative Reason
1  1002   The Outer Limits of Reasoning
2  1003              Exploring Robotics
3  1050  Intro to Computer Applications
4  1115       Intro to JAVA Programming

   student_id  course grade  points_earned  max_points
0     7798814    1600     a              4           4
1     7798814    1002     a              4           4
2     2149193    1400     a              4           4
3     2149193    1003     b              3           4
4     2149193    1580     a              4           4

   student_id  course grade  points_earned  max_points
0     7798814    2210     a              4           4
1     7798814    1215     b              3           4
2     2149193    1600     a              4           4
3     2149193    1170     b              3           4
4     2149193    1597     a              4           4

        id         career
0  7798814     publishing
1  2149193      education
2  5062031       graphics
3  7361386  self-employed
4  5484525      logistics

##  1. Use merging to produce a DataFrame showing which students belong to which clubs.

In [127]:
students_df['id'].info()
print('\n\n\n',students_df['id'].nunique())

<class 'pandas.core.series.Series'>
RangeIndex: 494 entries, 0 to 493
Series name: id
Non-Null Count  Dtype
--------------  -----
494 non-null    int64
dtypes: int64(1)
memory usage: 4.0 KB



 494

In [128]:
clubs_df.info()
print('\n\n\n',clubs_df['student_id'].nunique())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  312 non-null    int64
 1   club        312 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.0+ KB



 267

In [129]:
students_clubs = pd.merge(clubs_df, students_df, left_on='student_id', right_on='id', how='left')
students_clubs.drop('id', axis=1, inplace=True)
students_clubs.head()

,student_id,club,name
0,7798814,CS Club,Keith
1,2149193,CS Club,Denise
2,5062031,Cryptocurrency Club,Edward
3,7361386,Robotics Club,Jeffery
4,5484525,Entrepreneur Club,Spencer

In [130]:
students_clubs.info()
print('\n\n\n',students_clubs['student_id'].nunique())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  312 non-null    int64
 1   club        312 non-null    object
 2   name        312 non-null    object
dtypes: int64(1), object(2)
memory usage: 7.4+ KB



 267

## 2.In Question 1, did you perform a one-to-one, many-to-one, or many-to-many merge? Why?

I performed many to one because in the students df there are no duplicates, while in the clubs dataframe there are, so by performing many to one we keep the duplicates in clubs and associate each with a student name, this is because students have no reason not to be part of multiple clubs

## 3. Are there any students who are not in any clubs? If so, how many? Show their names and student ID.

In [131]:
students_no_clubs = students_df[~(students_df['id'].isin(clubs_df['student_id']))]
students_no_clubs.head()

,id,name
8,3822320,Jon
9,9548347,Jennifer
10,5131111,Leah
11,2227757,Grace
12,1802931,Troy

## 4. Use merging to produce a DataFrame showing the names of courses that students enrolled in.

In [132]:
f15_courses = pd.merge(f15_df, courses_df, left_on='course', right_on='id', how='left')
f15_courses = f15_courses.merge(students_df, left_on='student_id', right_on='id', how='left').drop(['id_y', 'id_x'], axis=1).rename(columns={'name_x':'course_name', 'name_y':'student_name'})
f15_courses.head()

,student_id,course,grade,points_earned,max_points,course_name,student_name
0,7798814,1600,a,4,4,Intro Multi Comput,Keith
1,7798814,1002,a,4,4,The Outer Limits of Reasoning,Keith
2,2149193,1400,a,4,4,Elementary Robotics,Denise
3,2149193,1003,b,3,4,Exploring Robotics,Denise
4,2149193,1580,a,4,4,Computer Mangement Games,Denise

In [133]:
s16_courses = pd.merge(s16_df, courses_df, left_on='course', right_on='id', how='left')
s16_courses = s16_courses.merge(students_df, left_on='student_id', right_on='id', how='left').drop(['id_y', 'id_x'], axis=1).rename(columns={'name_x':'course_name', 'name_y':'student_name'})
s16_courses.head()

,student_id,course,grade,points_earned,max_points,course_name,student_name
0,7798814,2210,a,4,4,Discrete Structure,Keith
1,7798814,1215,b,3,4,Intro to Programming in Python,Keith
2,2149193,1600,a,4,4,Intro Multi Comput,Denise
3,2149193,1170,b,3,4,Java for Programmers,Denise
4,2149193,1597,a,4,4,New Media and Business,Denise

In [134]:
fullyear = pd.concat([f15_courses, s16_courses])
fullyear.sort_values('student_id', inplace=True)
fullyear.reset_index(inplace=True, drop=True)
fullyear.head()

,student_id,course,grade,points_earned,max_points,course_name,student_name
0,1015901,1597,a,4,4,New Media and Business,Scott
1,1015901,1215,a,4,4,Intro to Programming in Python,Scott
2,1015901,2210,a,4,4,Discrete Structure,Scott
3,1015901,1590,b,3,4,Management Information Systems,Scott
4,1017158,1001,a,4,4,Computing &Quantitative Reason,Ernest

## 5. In Question 4, did you perform a one-to-one, many-to-one, or many-to-many merge? Why?

I performed many to one, students has no duplicate ids but courses does, so many to one attributes the many duplicates in courses with the name of the student in ids, same for courses

## 6. For the whole F15/S16 academic year, what is the name of the course that is probably the hardest? Which is probably the easiest? Ignore withdrawals when determining the answer

In [183]:
# lambda to identify pass of fail
fullyear1516 = fullyear[fullyear['grade'] != 'w']
fyc = fullyear1516[['course_name', 'grade']]

def pass_or_fail(grade):
  if grade in ['a', 'b', 'c']:
    return 'pass'
  else:
    return 'fail'

fyc['pass_or_fail'] = fyc['grade'].apply(pass_or_fail)
fyc.drop('grade',axis=1, inplace=True)
fyc

,course_name,pass_or_fail
0,New Media and Business,pass
1,Intro to Programming in Python,pass
2,Discrete Structure,pass
3,Management Information Systems,pass
4,Computing &Quantitative Reason,pass
...,...,...
2235,Computer Mangement Games,pass
2236,Intro to Programming in Python,pass
2237,Discrete Structure,pass
2238,New Media and Business,pass
2239,Management Information Systems,pass

In [184]:
#group by course and value count new column to get pass or fail for each course
fyc = fyc.groupby('course_name')['pass_or_fail'].value_counts()
fyc

course_name                     pass_or_fail
Computer Mangement Games        pass            126
                                fail             22
Computing &Quantitative Reason  pass            127
                                fail             29
Discrete Structure              pass             68
                                fail             10
Electronic Commerce             pass            136
                                fail             24
Elementary Robotics             pass            130
                                fail             24
Exploring Robotics              pass            120
                                fail             27
Intro Multi Comput              pass            135
                                fail             31
Intro to Computer Applications  pass            114
                                fail             34
Intro to JAVA Programming       pass            120
                                fail             20
Intro to Programming in Python  pass            131
                                fail             22
Java for Programmers            pass            147
                                fail             25
Management Information Systems  pass            134
                                fail             19
New Media and Business          pass            130
                                fail             23
The Outer Limits of Reasoning   pass            138
                                fail             27
Name: count, dtype: int64

In [185]:
#qol stuff
fyc = pd.DataFrame(fyc)
fyc.reset_index(inplace=True)
fyc.head()

,course_name,pass_or_fail,count
0,Computer Mangement Games,pass,126
1,Computer Mangement Games,fail,22
2,Computing &Quantitative Reason,pass,127
3,Computing &Quantitative Reason,fail,29
4,Discrete Structure,pass,68

In [186]:
courses = fyc['course_name'].unique()
courses

array(['Computer Mangement Games', 'Computing &Quantitative Reason',
       'Discrete Structure', 'Electronic Commerce', 'Elementary Robotics',
       'Exploring Robotics', 'Intro Multi Comput',
       'Intro to Computer Applications', 'Intro to JAVA Programming',
       'Intro to Programming in Python', 'Java for Programmers',
       'Management Information Systems', 'New Media and Business',
       'The Outer Limits of Reasoning'], dtype=object)

In [188]:
fyc[fyc['course_name'] == 'Electronic Commerce']

,course_name,pass_or_fail,count
6,Electronic Commerce,pass,136
7,Electronic Commerce,fail,24

In [189]:
def percentage(row):
  course = row['course_name']
  p_or_f_count = row['count']
  course_count = fyc[(fyc['course_name'] == course)]['count'].sum()

  return (p_or_f_count / course_count) * 100


fyc['pf_percentage'] = fyc.apply(percentage, axis=1)
fyc.head()

,course_name,pass_or_fail,count,pf_percentage
0,Computer Mangement Games,pass,126,85.135135
1,Computer Mangement Games,fail,22,14.864865
2,Computing &Quantitative Reason,pass,127,81.410256
3,Computing &Quantitative Reason,fail,29,18.589744
4,Discrete Structure,pass,68,87.179487

In [191]:
fyc[fyc['course_name'] == 'Electronic Commerce']

,course_name,pass_or_fail,count,pf_percentage
6,Electronic Commerce,pass,136,85.0
7,Electronic Commerce,fail,24,15.0

In [192]:
fyc.sort_values('pf_percentage', ascending=False, inplace=True)
fyc.head(30)

,course_name,pass_or_fail,count,pf_percentage
22,Management Information Systems,pass,134,87.581699
4,Discrete Structure,pass,68,87.179487
16,Intro to JAVA Programming,pass,120,85.714286
18,Intro to Programming in Python,pass,131,85.620915
20,Java for Programmers,pass,147,85.465116
0,Computer Mangement Games,pass,126,85.135135
6,Electronic Commerce,pass,136,85.000000
24,New Media and Business,pass,130,84.967320
8,Elementary Robotics,pass,130,84.415584
26,The Outer Limits of Reasoning,pass,138,83.636364
10,Exploring Robotics,pass,120,81.632653
2,Computing &Quantitative Reason,pass,127,81.410256
12,Intro Multi Comput,pass,135,81.325301
14,Intro to Computer Applications,pass,114,77.027027
15,Intro to Computer Applications,fail,34,22.972973
13,Intro Multi Comput,fail,31,18.674699
3,Computing &Quantitative Reason,fail,29,18.589744
11,Exploring Robotics,fail,27,18.367347
27,The Outer Limits of Reasoning,fail,27,16.363636
9,Elementary Robotics,fail,24,15.584416
25,New Media and Business,fail,23,15.032680
7,Electronic Commerce,fail,24,15.000000
1,Computer Mangement Games,fail,22,14.864865
21,Java for Programmers,fail,25,14.534884
19,Intro to Programming in Python,fail,22,14.379085
17,Intro to JAVA Programming,fail,20,14.285714
5,Discrete Structure,fail,10,12.820513
23,Management Information Systems,fail,19,12.418301

## 7. Did any students not enroll in any course during the whole F15/S16 academic year? Who?

In [136]:
students_unenrolled = students_df[ ~(students_df['id'].isin(f15_df['student_id'])) ]
students_unenrolled

,id,name
420,9224256,Ron

In [137]:
students_unenrolled = students_df[ ~(students_df['id'].isin(s16_df['student_id'])) ]
students_unenrolled

,id,name
21,7556881,Hannah
30,3704367,Claudia
67,7670762,Kristi
125,1234706,Tasha
183,8584823,Dustin
184,3438733,Kelsey
397,3528815,Raymond
420,9224256,Ron
422,7624676,Kate

In [141]:
students_unenrolled = students_df[ ~(students_df['id'].isin(fullyear['student_id'])) ]
students_unenrolled

,id,name
420,9224256,Ron

## 8. Over the whole F15/S16 academic year, what career was most common among students taking 1215?

In [138]:
fullyear_careers = pd.merge(fullyear, careers_df, left_on='student_id', right_on='id', how='left').drop('id', axis=1)
fullyear_careers[fullyear_careers['course'] == 1215 ]['career'].value_counts()

career
gamedev          19
research         15
finance          15
consulting       13
robotics         13
security         12
graphics         12
publishing       11
hardware         11
startup          10
ecommerce         7
education         7
manufacturing     6
self-employed     6
logistics         5
Name: count, dtype: int64

The most common career was gamedev with 19, and then research and finance tied at 15, with third being a tie between consulting and robotics

# 3 Concatenation (8 points)

## 1. Show the result if we concatenate df1, df2 with axis=0.

In [194]:
df1 = pd.DataFrame({'a':[4,5], 'b':[9,3]})
df2 = pd.DataFrame({'a':[3,4], 'b':[23,21]})

In [195]:
df1.head()

,a,b
0,4,9
1,5,3

In [196]:
df2.head()

,a,b
0,3,23
1,4,21

In [198]:
df_c1 = pd.concat([df1, df2], axis=0)
df_c1

,a,b
0,4,9
1,5,3
0,3,23
1,4,21

## 2. Show the result if we concatenate df1, df2 with axis=1.

In [199]:
df_c2 = pd.concat([df1, df2], axis=1)
df_c2

,a,b,a,b
0,4,9,3,23
1,5,3,4,21

## 3. Assume df2 has columns c, d instead of a, b. Show the result if we concatenate df1, df2 withaxis=0.

In [201]:
df2.columns = ['c', 'd']
df2.head()

pd.concat([df1, df2], axis=0)

,a,b,c,d
0,4.0,9.0,NaN,NaN
1,5.0,3.0,NaN,NaN
0,NaN,NaN,3.0,23.0
1,NaN,NaN,4.0,21.0

## 4. Assume df2 has columns c, d instead of a, b. Show the result if we concatenate df1, df2 withaxis=1.

In [202]:
pd.concat([df1, df2], axis=1)

,a,b,c,d
0,4,9,3,23
1,5,3,4,21

# 4 Merging (14 points)

In [204]:
books_data = {
    'isbn': [119935, 559332, 660352, 2118532],
    'title': ['Jane Eyre', 'Fahrenheit 451', 'Lord of the Rings', '1984']
}
books_df = pd.DataFrame(books_data)

# genres DataFrame
genres_data = {
    'isbn': [119935, 559332, 660352, 2118532],
    'genre': ['romance', 'dystopian', 'fantasy', 'dystopian']
}
genres_df = pd.DataFrame(genres_data)

# read DataFrame
read_data = {
    'isbn': [119935, 559332, 660352, 2118532, 119935],
    'name': ['Matt', 'Alice', 'Matt', 'Bob', 'Alice']
}
read_df = pd.DataFrame(read_data)

# favorites DataFrame
favorites_data = {
    'name': ['Matt', 'Alice', 'Bob', 'Bob', 'Matt', 'Bob'],
    'genre': ['sci-fi', 'fantasy', 'history', 'nonfiction', 'dystopian', 'fantasy']
}
favorites_df = pd.DataFrame(favorites_data)

print(books_df)
print("\n\n\n", genres_df)
print("\n\n\n", read_df)
print("\n\n\n", favorites_df)

      isbn              title
0   119935          Jane Eyre
1   559332     Fahrenheit 451
2   660352  Lord of the Rings
3  2118532               1984



       isbn      genre
0   119935    romance
1   559332  dystopian
2   660352    fantasy
3  2118532  dystopian



       isbn   name
0   119935   Matt
1   559332  Alice
2   660352   Matt
3  2118532    Bob
4   119935  Alice



     name       genre
0   Matt      sci-fi
1  Alice     fantasy
2    Bob     history
3    Bob  nonfiction
4   Matt   dystopian
5    Bob     fantasy

## 1. What type (one-to-one, many-to-one, many-to-many) is the merge across books and genres? Why?

One to one, as there is is no duplicate values many to one or the reverse is not needed, one to one is just fine

## 2. What type (one-to-one, many-to-one, many-to-many) is the merge across genres and favorites? Why?

Many to One as we have people with lots of favorites on the left side aka genre and no duplicates on the right so many to one would provide all of the rows on the left with a row on the right, thus not reducing the favorites on the left side.

## 3. What type (one-to-one, many-to-one, many-to-many) is the merge across genres and read? Why?

Many to one becuase while there is no duplicate genre there are duplicate reads to provding the many reads with a genre name that coresponds would be the best option.

## 4. Show the result of performing a merge across genres (left) and favorites (right) for each of the following merges:
(a) Left

(b) Right

(c) Inner

(d) Outer

In [205]:
pd.merge(genres_df, favorites_df, how='left', on='genre')

,isbn,genre,name
0,119935,romance,None
1,559332,dystopian,Matt
2,660352,fantasy,Alice
3,660352,fantasy,Bob
4,2118532,dystopian,Matt

Left merging provides everything on the left with a match so in this cases all the genres in genre_df are given the matches they have in favorites_Df and in this case they are all either fullfilled or not.

In [206]:
pd.merge(genres_df, favorites_df, how='right', on='genre')

,isbn,genre,name
0,559332.0,dystopian,Matt
1,660352.0,fantasy,Bob
2,660352.0,fantasy,Alice
3,2118532.0,dystopian,Matt
4,NaN,sci-fi,Matt
5,NaN,history,Bob
6,NaN,nonfiction,Bob

Right merging provided everything on the right with the match they have in genres or simply has none, so its similat to the left result but instead of name having none isbn has nan because we weren't provided with all the isbns possible or names for the last question.

In [207]:
pd.merge(genres_df, favorites_df, how='inner', on='genre')

,isbn,genre,name
0,660352,fantasy,Alice
1,559332,dystopian,Matt
2,2118532,dystopian,Matt
3,660352,fantasy,Bob

Inner merging provides everything with a match so we got no none nan values, this is useful for making sure we see the actual matching rows and nothing else.

In [208]:
pd.merge(genres_df, favorites_df, how='outer', on='genre')

,isbn,genre,name
0,NaN,sci-fi,Matt
1,NaN,history,Bob
2,NaN,nonfiction,Bob
3,559332.0,dystopian,Matt
4,660352.0,fantasy,Bob
5,660352.0,fantasy,Alice
6,2118532.0,dystopian,Matt
7,119935.0,romance,None

Outer merge just shows you everything which can be useful to gain a view on the entier merged data.